tutorials/mesh/blockEjection/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    group_inlet
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
    group_outlet
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    // Moving block; prescribed motion on pointDisplacement
    group_moving
    {
        type            uniformFixedValue;
        //uniformValue    (0 0 0);
        uniformValue    table
        (
            (0 (0 0 0))
            (1 (10 0 0))
        );
    }

    // Slip
    group_slip
    {
        type            slip;
    }

    // no-slip on stationay walls
    group_stationary
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    // Central AMI are slip as well
    central_bottom_couple
    {
        patchType       cyclicACMI;
        type            slip;
    }
    central_top_couple
    {
        patchType       cyclicACMI;
        type            slip;
    }

    // Top/bottom AMI are no-slip
    bottom_central_couple
    {
        patchType       cyclicACMI;
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
    top_central_couple
    {
        patchType       cyclicACMI;
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
}


// ************************************************************************* //
